import 'package:flutter/services.dart';

class Sura{
  int index;
  late String name;
  late List<String> verses;
  late String type;


  Sura({required this.index}){
    name=suraNames[index];
    type=suraTypeList[index];
    //verses=getSuraVerses() as List<String>;
  }

  List<String> suraNames=["الفاتحه","البقرة","آل عمران","النساء","المائدة","الأنعام","الأعراف","الأنفال","التوبة","يونس","هود"
    ,"يوسف","الرعد","إبراهيم","الحجر","النحل","الإسراء","الكهف","مريم","طه","الأنبياء","الحج","المؤمنون"
    ,"النّور","الفرقان","الشعراء","النّمل","القصص","العنكبوت","الرّوم","لقمان","السجدة","الأحزاب","سبأ"
    ,"فاطر","يس","الصافات","ص","الزمر","غافر","فصّلت","الشورى","الزخرف","الدّخان","الجاثية","الأحقاف"
    ,"محمد","الفتح","الحجرات","ق","الذاريات","الطور","النجم","القمر","الرحمن","الواقعة","الحديد","المجادلة"
    ,"الحشر","الممتحنة","الصف","الجمعة","المنافقون","التغابن","الطلاق","التحريم","الملك","القلم","الحاقة","المعارج"
    ,"نوح","الجن","المزّمّل","المدّثر","القيامة","الإنسان","المرسلات","النبأ","النازعات","عبس","التكوير","الإنفطار"
    ,"المطفّفين","الإنشقاق","البروج","الطارق","الأعلى","الغاشية","الفجر","البلد","الشمس","الليل","الضحى","الشرح"
    ,"التين","العلق","القدر","البينة","الزلزلة","العاديات","القارعة","التكاثر","العصر",
    "الهمزة","الفيل","قريش","الماعون","الكوثر","الكافرون","النصر","المسد","الإخلاص","الفلق","الناس"];
  List<String> suraTypeList=[
    "مكية",
    "مدنية",
    "مدنية",
    "مدنية",
    "مدنية",
    "مكية",
    "مكية",
    "مدنية",
    "مدنية",
    "مكية",
    "مكية",
    "مكية",
    "مدنية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مدنية",
    "مكية",
    "مدنية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مدنية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مدنية",
    "مدنية",
    "مدنية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مدنية",
    "مكية",
    "مدنية",
    "مدنية",
    "مدنية",
    "مدنية",
    "مدنية",
    "مدنية",
    "مدنية",
    "مدنية",
    "مدنية",
    "مدنية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مدنية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مدنية",
    "مدنية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
    "مدنية",
    "مكية",
    "مكية",
    "مكية",
    "مكية",
  ];

  Future<void> getSuraVerses()async
  {
    String data=await rootBundle.loadString('assets/quraan/${index+1}.txt');
    verses=data.trim().split('\n');
  }
}